{"config": [{"config": {"name": "convolution2d_1", "b_regularizer": null, "trainable": true, "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "dim_ordering": "tf", "nb_filter": 16, "input_dtype": "float32", "batch_input_shape": [null, 33, 100, 3], "b_constraint": null, "subsample": [2, 2], "border_mode": "valid", "W_regularizer": null, "bias": true, "activation": "relu", "nb_col": 3, "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"name": "convolution2d_2", "b_regularizer": null, "trainable": true, "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "dim_ordering": "tf", "nb_filter": 48, "bias": true, "b_constraint": null, "subsample": [1, 1], "border_mode": "valid", "W_regularizer": null, "activation": "relu", "nb_col": 3, "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"name": "convolution2d_3", "b_regularizer": null, "trainable": true, "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "dim_ordering": "tf", "nb_filter": 64, "bias": true, "b_constraint": null, "subsample": [1, 1], "border_mode": "valid", "W_regularizer": null, "activation": "relu", "nb_col": 3, "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dropout_1", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "dense_1", "b_regularizer": null, "input_dim": 34560, "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "output_dim": 100, "b_constraint": null, "W_regularizer": null, "activation": "relu", "bias": true}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "b_regularizer": null, "input_dim": 100, "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "output_dim": 50, "b_constraint": null, "W_regularizer": null, "activation": "relu", "bias": true}, "class_name": "Dense"}, {"config": {"name": "dense_3", "b_regularizer": null, "input_dim": 50, "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "output_dim": 10, "b_constraint": null, "W_regularizer": null, "activation": "relu", "bias": true}, "class_name": "Dense"}, {"config": {"name": "dense_4", "b_regularizer": null, "input_dim": 10, "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "output_dim": 1, "b_constraint": null, "W_regularizer": null, "activation": "linear", "bias": true}, "class_name": "Dense"}], "keras_version": "1.2.1", "class_name": "Sequential"}